Repository: HusseinMohamed99/Fakahani_Dashboard
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_title
source: Fakahani
ar: فكهانى

source: Faka
ar: فكـ

source: Hani
ar: هانى

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكترونى

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# email_empty
source: Email can't be empty
ar: لا يمكن ترك البريد الإلكترونى فارغًا

# email_valid
source: Please enter a valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صالح

# password_empty
source: Password can't be empty
ar: لا يمكن ترك كلمة المرور فارغة

# password_length
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون على الأقل 8 حروف

# password_does_not_match
source: Passwords don't match
ar: كلمات المرور لا تتطابق

# password_missing_uppercase
source: Password must contain at least one uppercase letter
ar: كلمة المرور يجب أن تحتوي على حروف كبيرة

# password_missing_lowercase
source: Password must contain at least one lowercase letter
ar: كلمة المرور يجب أن تحتوي على حروف صغيرة

# password_missing_number
source: Password must contain at least one number
ar: كلمة المرور يجب أن تحتوي على رقم

# password_missing_special
source: Password must contain at least one special character
ar: كلمة المرور يجب أن تحتوي على رمز خاص

# full_name_empty
source: Full name can't be empty
ar: لا يمكن ترك الاسم الكامل فارغًا

source: Email already exists
ar: البريد الإلكتروني موجود بالفعل

# phone_already_exists
source: Phone number already exists
ar: رقم الهاتف موجود بالفعل

# phone_empty
source: Phone number can't be empty
ar: لا يمكن ترك رقم الهاتف فارغًا

# phone_valid
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صالح

# full_name_minimum_length
source: Full name must be at least 3 characters
ar: يجب أن يحتوي الاسم الكامل على 3 أحرف على الأقل

# full_name_maximum_length
source: Full name must be at most 20 characters
ar: يجب أن يحتوي الاسم الكامل على 20 حرفًا كحد أقصى

# otp_empty
source: OTP can't be empty
ar: لا يمكن ترك رمز التحقق فارغًا

# otp_valid
source: Please enter a valid OTP
ar: الرجاء إدخال رمز التحقق صالح

# otp_length
source: OTP must be 4 digits
ar: الرمز التحقق يجب على الأقل 4 رقم

source: OTP
ar: رمز التحقق

# email_already_inUse_error
source: The account already exists for that email.
ar: عنوان البريد الإلكتروني قيد الاستخدام بالفعل بواسطة حساب آخر.

# general_error
source: An error occurred, please try again later.
ar: حدث خطأ غير معروف. يرجى المحاولة لاحقًا.

# terms_of_conditions_error
source: You must agree to the terms of conditions.
ar: يجب عليك الموافقة على الشروط والأحكام.

source: Account created successfully
ar: تم إنشاء الحساب بنجاح

# network_request_failed_message
source: Please check your internet connection
ar: حدث خطأ في الشبكة. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# invalid_email_message
source: The email address is badly formatted.
ar: عنوان البريد الإلكتروني بتنسيق غير صحيح.

# operation_not_allowed_message
source: Email/password accounts are not enabled. Please enable it in Firebase.
ar: حسابات البريد الإلكتروني/كلمة المرور غير مفعلّة. الرجاء تفعيلها في Firebase.

# user_disabled_message
source: This user account has been disabled by an administrator.
ar: تم تعطيل حساب هذا المستخدم بواسطة المسؤول.

# internal_error_message
source: An internal error occurred. Please try again later.
ar: حدث خطأ داخلي. يرجى المحاولة مرة أخرى لاحقًا.

# too_many_requests_message
source: Too many requests. Please try again later.
ar: تم إرسال العديد من الطلبات. يرجى المحاولة لاحقًا.

# wrong_password_message
source: Incorrect password. Please try again.
ar: كلمة المرور خاطئة. يرجى المحاولة مرة أخرى.

# user_not_found_message
source: No user found with this email.
ar: لم يتم العثور على حساب باستخدام هذا البريد الإلكتروني.

# email_or_password_incorrect
source: Email or password is incorrect
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Sign in successfully
ar: تم تسجيل الدخول بنجاح

# account_exists_message
source: An account already exists with a different credential.
ar: يوجد حساب بالفعل ببيانات مختلفة.

source: Start Now
ar: ابدأ الآن

source: Welcome
ar: مرحبًا بك

source: To
ar: في

# welcome_subtitle_first
source: We’re excited to see what you’re adding! Fill in the details below, and don’t forget to upload some great images
ar: يسعدنا أن نرى ما ستضيفه! املأ التفاصيل أدناه، ولا تنس تحميل بعض الصور الرائعة.

# welcome_subtitle_second
source: Your product will be live and ready for customers in just a few steps.
ar: سيكون منتجك جاهزًا للعملاء في بضع خطوات فقط.
